Revit 2026 API
IFCHybridImport.UpdateElements Method
Overload List
Name | Description
UpdateElements(Document, String) | Obsolete.
 Updates IFC Elements using AnyCAD.
UpdateElements(Document, String, IFCHybridImportOptions) |  Updates IFC Elements using AnyCAD.
Top
See Also
Reference
IFCHybridImport Class
Autodesk.Revit.DB.IFC Namespace